Конфигурация/DataProcessors/СводноеНачислениеДивидендов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>СводноеНачислениеДивидендов</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Конфигурация/InformationRegisters/КодыВоВнешнихСистемах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КодыВоВнешнихСистемах</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>55</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДопКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>55</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопКод1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>55</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопКод0</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеЗначения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВнешняяСистема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаОбъектов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыИмпортируемыхОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Documents/НачислениеДивидендов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>НачислениеДивидендов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>InformationRegister.ОперацииСЦеннымиБумагами</xr:Item>
				<xr:Item>AccountingRegister.ЕдиныйБухгалтерскийУчет</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Паи</v8:Type>
						<v8:Type>cfg:CatalogRef.ДепозитарныеРасписки</v8:Type>
						<v8:Type>cfg:CatalogRef.Доли</v8:Type>
						<v8:Type>cfg:CatalogRef.ИпотечныеСертификатыУчастия</v8:Type>
						<v8:Type>cfg:CatalogRef.Акции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРеестра</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПубликации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОплатыПлановая</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДивидендыНаЦеннуюБумагу</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦенаДивиденды</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рынок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОбъявленная</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентНалога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/DataProcessors/СводноеНачислениеДивидендов/Forms/СозданиеНачисленияДивидендов/Ext/Form/Module.bsl
#Область События_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ЭтаФорма.Параметры, "Организация, Дата, ДатаРеестра, ДатаПубликации, ДатаОплатыПлановая, ЦеннаяБумага, ДивидендыНаЦеннуюБумагу, Д1, Д2, ИдСобытия");
	
	ВалютаНоминала = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЦеннаяБумага, "ВалютаНоминала");
	
	Для каждого СтрокаНачисленияДивидендов Из ЭтаФорма.Параметры.НачисленияДивидендов Цикл
		
		НоваяСтрокаНачисленияДивидендов = НачисленияДивидендов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаНачисленияДивидендов, СтрокаНачисленияДивидендов);
		
		НоваяСтрокаНачисленияДивидендов.ВалютаОплаты = ВалютаНоминала; 
		
	КонецЦикла;
	
	ТаблицаДанных = РегистрыСведений.НастройкиУчетаДоходовПоЦеннымБумагам.ПолучитьЗначенияНастроекУчетаДоходовПоЦеннымБумагам(РеквизитФормыВЗначение("НачисленияДивидендов"), ЭтаФорма.Дата, ЭтаФорма.Организация);
	
	ЗначениеВРеквизитФормы(ТаблицаДанных, "НачисленияДивидендов");
	
	ОбновитьНадписьНачисленияДивидендовИтого(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если НЕ ЗавершениеРаботы И Не ЭтаФорма.ПовторноеЗакрытие Тогда
		
		Отказ = Истина;
		
		ЭтаФорма.ПовторноеЗакрытие = Истина;
		
		ЭтаФорма.Закрыть(
			?(ЭтаФорма.СозданныеДокументы.Количество() = 0, Неопределено, ЭтаФорма.СозданныеДокументы.ВыгрузитьЗначения()));
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область События_элементов_формы

&НаКлиенте
Процедура НачисленияДивидендовОплатаЧерезБрокераПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.НачисленияДивидендов.ТекущиеДанные;
	
	Если Не ТекущиеДанные.ОплатаЧерезБрокера Тогда
		ТекущиеДанные.Брокер = Неопределено;
	КонецЕсли;
	
	НачисленияДивидендовБрокерПриИзменении(ТекущиеДанные.ОплатаЧерезБрокера);
	
КонецПроцедуры

&НаКлиенте
Процедура НачисленияДивидендовБрокерПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.НачисленияДивидендов.ТекущиеДанные;
	
	ТекущиеДанные.ДетализацияПоРасчетномуСчету = РаботаСДокументами.ТребуетсяДетализацияПоРасчетномуСчету(
		Новый Структура("Дата, Организация, Брокер", ЭтаФорма.Дата, ЭтаФорма.Организация, ТекущиеДанные.Брокер));
	
	Если Не ТекущиеДанные.ДетализацияПоРасчетномуСчету Тогда
		ТекущиеДанные.РасчетныйСчет = Неопределено;
	КонецЕсли;		
	
КонецПроцедуры

&НаКлиенте
Процедура НачисленияДивидендовРасчетныйСчетПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.НачисленияДивидендов.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.РасчетныйСчет) Тогда
		ТекущиеДанные.ВалютаОплаты = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущиеДанные.РасчетныйСчет, "Валюта");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачисленияДивидендовКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.НачисленияДивидендов.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.СуммаОбъявленная = ТекущиеДанные.Количество * ЭтаФорма.ДивидендыНаЦеннуюБумагу;
	Если ТекущиеДанные.НачислятьОбязательства Тогда 
		ТекущиеДанные.Сумма = ТекущиеДанные.СуммаОбъявленная - РаботаСНалогамиКлиентСервер.РасчетНалогаСДивидендов(ТекущиеДанные.СуммаОбъявленная, ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущиеДанные.СчетДоверительногоУправления, "ВидДоговораДоверительногоУправления"), ЭтаФорма.Д1, ЭтаФорма.Д2); 
	Иначе
		ТекущиеДанные.Сумма = ТекущиеДанные.СуммаОбъявленная;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура НачисленияДивидендовСуммаОбъявленнаяПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.НачисленияДивидендов.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.НачислятьОбязательства Тогда 
		ТекущиеДанные.Сумма = ТекущиеДанные.СуммаОбъявленная - РаботаСНалогамиКлиентСервер.РасчетНалогаСДивидендов(ТекущиеДанные.СуммаОбъявленная, ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущиеДанные.СчетДоверительногоУправления, "ВидДоговораДоверительногоУправления"), ЭтаФорма.Д1, ЭтаФорма.Д2); 
	Иначе
		ТекущиеДанные.Сумма = ТекущиеДанные.СуммаОбъявленная;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура НачисленияДивидендовПриИзменении(Элемент)
	
	ОбновитьНадписьНачисленияДивидендовИтого(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область Команды_формы

&НаКлиенте
Процедура КомандаСоздатьДокументы(Команда)
	
	Если СоздатьНачисленияДивидендовНаСервере() Тогда
		ВсеДокументыСозданы = ЭтаФорма.СозданныеДокументы.Количество() = ЭтаФорма.НачисленияДивидендов.Количество();
		Элементы.ФормаКомандаСоздатьДокументы.Доступность = НЕ ВсеДокументыСозданы;
		ЭтаФорма.ПовторноеЗакрытие = ВсеДокументыСозданы;
		ЭтаФорма.Закрыть(Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Служебные_процедуры_и_функции

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьНадписьНачисленияДивидендовИтого(Форма)
	
	ТекстНадписи = "";
	
	Если Форма.НачисленияДивидендов.Количество() > 0 Тогда
		
		ИтогоКоличество       = 0;
		ИтогоСуммаОбъявленная = 0;
		ИтогоСумма            = 0;
		
		Для каждого СтрокаНачисленияДивидендов Из Форма.НачисленияДивидендов Цикл
			ИтогоКоличество       = ИтогоКоличество       + СтрокаНачисленияДивидендов.Количество;
			ИтогоСуммаОбъявленная = ИтогоСуммаОбъявленная + СтрокаНачисленияДивидендов.СуммаОбъявленная;
			ИтогоСумма            = ИтогоСумма            + СтрокаНачисленияДивидендов.Сумма;
		КонецЦикла;
		
		ТекстНадписи = "Итого " + ИтогоКоличество + " " + РаботаСКорзинойЦенныхБумагКлиентСервер.ФормаМножественногоЧислаЦеннойБумаги(ИтогоКоличество, РаботаСЦеннымиБумагамиКлиентСервер.РынокПоЦеннойБумаге(Форма.ЦеннаяБумага))
			+ " на сумму " + ИтогоСумма + ", сумма объявленная " + ИтогоСуммаОбъявленная;
		
	КонецЕсли;
	
	Форма.Элементы.НадписьНачисленияДивидендовИтого.Заголовок = ТекстНадписи;
	
КонецПроцедуры // ОбновитьНадписьНачисленияДивидендовИтого

&НаСервере
Функция СоздатьНачисленияДивидендовНаСервере()
	
	ЕстьОшибки = Ложь;
	
	// проверим заполнение на основе имеющихся данных
	Для НомСтр = 0 По ЭтаФорма.НачисленияДивидендов.Количество() - 1 Цикл
		
		СтрокаНачисленияДивидендов = ЭтаФорма.НачисленияДивидендов[НомСтр];
		
		Если СтрокаНачисленияДивидендов.Количество = 0 Тогда
			Сообщить("Не заполнено поле ""Количество"" в строке № " + (НомСтр + 1));
			ЕстьОшибки = Истина;
		КонецЕсли;
		
		Если СтрокаНачисленияДивидендов.СуммаОбъявленная = 0 Тогда
			Сообщить("Не заполнено поле ""Сумма объявленная"" в строке № " + (НомСтр + 1));
			ЕстьОшибки = Истина;
		КонецЕсли;
		
		Если СтрокаНачисленияДивидендов.Сумма = 0 Тогда
			Сообщить("Не заполнено поле ""Сумма"" в строке № " + (НомСтр + 1));
			ЕстьОшибки = Истина;
		КонецЕсли;
		
		Если СтрокаНачисленияДивидендов.ОплатаЧерезБрокера И Не ЗначениеЗаполнено(СтрокаНачисленияДивидендов.Брокер) Тогда
			Сообщить("Не заполнено поле ""Брокер"" в строке № " + (НомСтр + 1));
			ЕстьОшибки = Истина;
		КонецЕсли;
		
		Если СтрокаНачисленияДивидендов.ДетализацияПоРасчетномуСчету И Не ЗначениеЗаполнено(СтрокаНачисленияДивидендов.РасчетныйСчет) Тогда
			Сообщить("Не заполнено поле ""Расчетный счет"" в строке № " + (НомСтр + 1));
			ЕстьОшибки = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЕстьОшибки Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// создадим документ
	Для НомСтр = 0 По ЭтаФорма.НачисленияДивидендов.Количество() - 1 Цикл
		
		СтрокаНачисленияДивидендов = ЭтаФорма.НачисленияДивидендов[НомСтр];
		
		Если СтрокаНачисленияДивидендов.ДокументСоздан Тогда
		
			Продолжить;
		
		КонецЕсли;
		
		НачислениеДивидендов = Документы.НачислениеДивидендов.СоздатьДокумент();
		
		ЗаполнитьЗначенияСвойств(НачислениеДивидендов, ЭтаФорма);
		ЗаполнитьЗначенияСвойств(НачислениеДивидендов, СтрокаНачисленияДивидендов);
		
		НачислениеДивидендов.Рынок		   = РаботаСЦеннымиБумагамиКлиентСервер.РынокПоЦеннойБумаге(ЭтаФорма.ЦеннаяБумага);	
		НачислениеДивидендов.Ответственный = РаботаСПользователями.ТекущийПользователь();
	
		Если Не НачислениеДивидендов.ПроверитьЗаполнение() Тогда
			Сообщить("Не удалось создать начисление дивидендов по строке № " + (НомСтр + 1));
			ЕстьОшибки = Истина;
		КонецЕсли;
	
		Попытка
			НачислениеДивидендов.Дата = НачалоДня(ДатаРеестра) + 20*60*60;
			НачислениеДивидендов.Записать(РежимЗаписиДокумента.Проведение);
			Сообщить("Создан документ " + НачислениеДивидендов);
			ЭтаФорма.СозданныеДокументы.Добавить(НачислениеДивидендов.Ссылка);
			СтрокаНачисленияДивидендов.ДокументСоздан = Истина;
			
			//Запишем ИдСобытия в регистр
			Если НачислениеДивидендов.Рынок = Перечисления.РынкиЦенныхБумаг.Акции Тогда 
				ЗаписьРегистр = РегистрыСведений.КодыВоВнешнихСистемах.СоздатьМенеджерЗаписи();
				ЗаписьРегистр.Период = НачислениеДивидендов.Дата;
				ЗаписьРегистр.ВнешняяСистема = Справочники.ВнешниеСистемы.НРД;
				ЗаписьРегистр.ГруппаОбъектов = Справочники.ГруппыИмпортируемыхОбъектов.КорпоративноеСобытиеПоВыплатеДивидендов;
				ЗаписьРегистр.Объект = НачислениеДивидендов.Ссылка; 
				ЗаписьРегистр.Код = ЭтаФорма.ИдСобытия; 
				ЗаписьРегистр.Записать();
			КонецЕсли;	
			
		Исключение
			Сообщить("Не удалось создать начисление дивидендов по строке № " + (НомСтр + 1));
			ЕстьОшибки = Истина;
		КонецПопытки;
	
	КонецЦикла;
	
	Возврат Не ЕстьОшибки;
	
КонецФункции // СоздатьНачисленияДивидендовНаСервере

#КонецОбласти
